6 семестр/КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/Documents/ВводЗалаВЭксплуатацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВводЗалаВЭксплуатацию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияСтатусовЗалов</xr:Item>
				<xr:Item>AccountingRegister.Проводки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Кинозалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кинозал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кинозалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

6 семестр/КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/InformationRegisters/ИсторияСтатусовЗалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСтатусовЗалов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кинозал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кинозалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

6 семестр/КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/Documents/ВводЗалаВЭксплуатацию/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаТЧ Из Кинозалы Цикл
		Если СтрокаТЧ.Кинозал.Состояние = Перечисления.СостоянияЗалов.Работает Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Кинозал """ + Строка(СтрокаТЧ.Кинозал) + """ уже числится работающим!";
			Сообщение.Поле = "Кинозалы[" + (СтрокаТЧ.НомерСтроки - 1) + "].Кинозал";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Для Каждого СтрокаТЧ Из Кинозалы Цикл
		Движение = Движения.ИсторияСтатусовЗалов.Добавить();
		Движение.Период = Дата;
		Движение.Кинозал = СтрокаТЧ.Кинозал;
		Движение.Статус = Перечисления.СтатусыЗалов.Свободен;
		
		ДвижениеБух = Движения.Проводки.Добавить();
		ДвижениеБух.Период = Дата;
		ДвижениеБух.СчетДт = ПланыСчетов.Управленческий.Касса;
		ДвижениеБух.СчетКт = ПланыСчетов.Управленческий.Касса;
		ДвижениеБух.Сумма = -СтрокаТЧ.Стоимость;
		
		ЗалОбъект = СтрокаТЧ.Кинозал.ПолучитьОбъект();
		ЗалОбъект.СтоимостьЗакупки = СтрокаТЧ.Стоимость;
		ЗалОбъект.Состояние = Перечисления.СостоянияЗалов.Работает;
		ЗалОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
